Revit 2025 API
DisplayUnit Enumeration
Describes the type of Revit display unit, metric or imperial.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum DisplayUnit
Public Enumeration DisplayUnit
public enum class DisplayUnit
type DisplayUnit
Members
Member name | Value | Description
METRIC | 0
IMPERIAL | 1
See Also
Reference
Autodesk.Revit.DB Namespace